>## Aplicação 03 - Sobreviventes do Titanic

O dataset utilizado está presente em: https://www.kaggle.com/datasets/yasserh/titanic-dataset

Objetivos:
    <li> Entender o conjunto de dados e a limpeza (se necessário).
    <li> Construir um modelo de classificação forte para prever se o passageiro sobreviverá ou não.
    <li> Ajustar os hiperparâmetros e comparar as métricas de avaliação

#### Etapa 01 - Importação das bibliotecas e pre-processamento dos dados

In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
from sklearn.metrics import confusion_matrix
from sklearn.preprocessing import LabelEncoder

#leitura do csv
dataset = './datasets/titanic.csv'
data = pd.read_csv(dataset)

In [2]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# Elimina as colunas

data.drop(['PassengerId','Name','Cabin','Ticket'],axis=1,inplace=True)
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [5]:
# Verifica se possu dados nulos

data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [6]:
train_set, test_set = train_test_split(data, test_size=0.2, random_state=1)

In [7]:
# Transformando o sexo em 0 e 1 (labeling)

train_set['Sex'] = train_set['Sex'].map({'male':0, 'female':1}).astype(int)
test_set['Sex'] = test_set['Sex'].map({'male':0, 'female':1}).astype(int)

In [8]:
train_set.head()

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
301         1       3    0   NaN      2      0  23.2500        Q
309         1       1    1  30.0      0      0  56.9292        C
516         1       2    1  34.0      0      0  10.5000        S
120         0       2    0  21.0      2      0  73.5000        S
570         1       2    0  62.0      0      0  10.5000        S

In [9]:
test_set.head()

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked
862         1       1    1  48.0      0      0  25.9292        S
223         0       3    0   NaN      0      0   7.8958        S
84          1       2    1  17.0      0      0  10.5000        S
680         0       3    1   NaN      0      0   8.1375        Q
535         1       2    1   7.0      0      2  26.2500        S

In [10]:
train_set = train_set[train_set.Age.notnull()]
test_set = test_set[test_set.Age.notnull()]

train_set.drop('Embarked', axis=1, inplace=True)
test_set.drop('Embarked', axis=1, inplace=True)

In [11]:
# O método pop remove a coluna e retorna a uma variável

y_train = train_set.pop('Survived')
y_test = test_set.pop('Survived')

#### Utilizando os parâmetros default do SVC

In [12]:
# Treinamento do classificador de sobrevivência

clf_sobre = SVC()
clf_sobre.fit(train_set,y_train)
prediction = clf_sobre.predict(test_set)

In [13]:
# Predicting the result and giving the accuracy
score = clf_sobre.score(test_set, y_test)

print(score)

0.6506849315068494

#### Utilizando um Kernel linear

In [14]:
# Treinamento do classificador de sobrevivência

clf_sobre = SVC(kernel='linear')
clf_sobre.fit(train_set,y_train)
prediction = clf_sobre.predict(test_set)

In [15]:
# Predicting the result and giving the accuracy
score = clf_sobre.score(test_set, y_test)

print(score)

0.7945205479452054

#### Utilziando um Kernel polinomial

In [16]:
# Treinamento do classificador de sobrevivência

clf_sobre = SVC(kernel='poly')
clf_sobre.fit(train_set,y_train)
prediction = clf_sobre.predict(test_set)

In [17]:
# Predicting the result and giving the accuracy
score = clf_sobre.score(test_set, y_test)

print(score)

0.589041095890411

#### Utilizando um Kernel RBF

In [18]:
# Treinamento do classificador de sobrevivência

clf_sobre = SVC(kernel='rbf')
clf_sobre.fit(train_set,y_train)
prediction = clf_sobre.predict(test_set)

In [19]:
# Predicting the result and giving the accuracy
score = clf_sobre.score(test_set, y_test)

print(score)

0.6506849315068494

In [20]:
# Treinamento do classificador de sobrevivência

clf_sobre = SVC(kernel='rbf',C=2000)
clf_sobre.fit(train_set,y_train)
prediction = clf_sobre.predict(test_set)

In [21]:
# Predicting the result and giving the accuracy
score = clf_sobre.score(test_set, y_test)

print(score)

0.8356164383561644